# Указываем базовый образ Node.js
FROM node:20.11.0-alpine3.18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /var/www/app_node

# Копируем package.json и package-lock.json
COPY package*.json ./

# Устанавливаем зависимости
RUN npm i -g pm2

# Копируем остальную часть кода приложения
COPY . .

# Экспонируем порт приложения (если необходимо)
EXPOSE 3000

# Указываем команду для запуска приложения с помощью PM2
# - i max говорит PM2 запустить максимальное количество процессов, соответствующее количеству ядер процессора
# "--no-daemon" нужен для docker
CMD ["pm2", "start", "./src/app.js", "-i", "max", "--no-daemon"]
